zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_filter.c
        for (snsIndex = context->ptrWdConfig[widgetId].numSns; snsIndex-- > 0u;)
        {
            bslnStatus |= Cy_CapSense_UpdateSensorBaseline(widgetId, snsIndex, context);
        }
    }

    return bslnStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_UpdateSensorBaseline
****************************************************************************//**
*
* Updates the baseline for a sensor in a widget specified by the
* input parameters.
*
* This function performs exactly the same tasks as
* Cy_CapSense_UpdateAllBaselines() and Cy_CapSense_UpdateWidgetBaseline()
* but only for a specified sensor.
*
* Calling this function multiple times without a new sensor scan leads to
* unexpected behavior and should be avoided. The application need not use
* this function if the Cy_CapSense_UpdateWidgetBaseline (),
* Cy_CapSense_UpdateAllBaselines (), Cy_CapSense_ProcessAllWidgets(),
* or Cy_CapSense_ProcessWidget() functions are already used.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \note For the fifth-generation low power CAPSENSE&trade; it is not recommended
* to call this function for widgets of the \ref CY_CAPSENSE_WD_LOW_POWER_E type.
*
* \param sensorId
* Specifies the ID number of the sensor within the widget. A macro for the
* sensor ID within a specified widget can be found in the cycfg_capsense.h
* file defined as CY_CAPSENSE_<WIDGET_NAME>_SNS<SENSOR_NUMBER>_ID.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the specified sensor update baseline operation:
* - CY_CAPSENSE_STATUS_SUCCESS - The operation is successfully completed.
* - CY_CAPSENSE_STATUS_BAD_PARAM - The input parameter is invalid.
* - CY_CAPSENSE_STATUS_BAD_DATA - The baseline processing failed.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_UpdateSensorBaseline(
                uint32_t widgetId,
                uint32_t sensorId,
                const cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t bslnStatus = CY_CAPSENSE_STATUS_BAD_PARAM;
    const cy_stc_capsense_widget_config_t * ptrWdCfg = &context->ptrWdConfig[widgetId];
    cy_stc_capsense_sensor_context_t * ptrSnsCxt = &ptrWdCfg->ptrSnsContext[sensorId];

    bslnStatus = Cy_CapSense_FtUpdateBaseline(ptrWdCfg->ptrWdContext, ptrSnsCxt, &ptrWdCfg->ptrBslnInv[sensorId], context);

    return bslnStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_CheckBaselineInv
****************************************************************************//**
*
* Check a matching of present baseline and its inverse duplication.
*
* \param ptrWdContext
* The pointer to the widget context structure where all the widget parameters
* are stored.
*
* \param ptrSnsContext
* The pointer to the sensor context structure where the sensor data
* is stored.
*
* \param ptrSnsBslnInv
* The pointer to the sensor baseline inversion used for BIST if enabled.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns a status indicating check result:
* - CY_CAPSENSE_STATUS_SUCCESS -  if the BIST baseline integrity test is enabled and
*                                 baseline and its inverse duplication match or BIST
*                                 baseline integrity test is disabled.
* - CY_CAPSENSE_STATUS_BAD_DATA - if the BIST baseline integrity test is enabled and
*                                 the sensor's baseline and its inversion doesn't
*                                 match. In this case the function as well clears
*                                 the bit[2] (Widget Working) of the .status field
*                                 in the widget context structure preventing corrupted
*                                 data usage and set the CY_CAPSENSE_BIST_BSLN_INTEGRITY_MASK
*                                 bit of the .testResultMask field
*                                 in the /ref cy_stc_capsense_bist_context_t structure.
*
*******************************************************************************/
static cy_capsense_status_t Cy_CapSense_CheckBaselineInv(
                cy_stc_capsense_widget_context_t * ptrWdContext,
                const cy_stc_capsense_sensor_context_t * ptrSnsContext,
                const uint16_t * ptrSnsBslnInv,
                const cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t result = CY_CAPSENSE_STATUS_SUCCESS;

    #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&\
         (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_BSLN_INTEGRITY_EN))
        uint16_t bslnInv = (uint16_t)(~ptrSnsContext->bsln);

        if (*ptrSnsBslnInv != bslnInv)
        {
            result = CY_CAPSENSE_STATUS_BAD_DATA;
            ptrWdContext->status &= (uint32_t)~(uint32_t)CY_CAPSENSE_WD_WORKING_MASK;
            context->ptrBistContext->testResultMask |= CY_CAPSENSE_BIST_BSLN_INTEGRITY_MASK;
        }
    #else
        (void)ptrWdContext;
        (void)ptrSnsContext;
        (void)ptrSnsBslnInv;
        (void)context;
    #endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&\
               (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_BSLN_INTEGRITY_EN)) */

    return result;
}

/*******************************************************************************
* Function Name: Cy_CapSense_FtUpdateBaseline
****************************************************************************//**
*
* Updates the baseline for a sensor specified by an input parameter.
*
* Check a matching of present baseline and its inverse duplication. If they
* match, then the function updates the baseline for a sensor specified by an input parameter.
* If they don't match, the function returns CY_CAPSENSE_TST_BSLN_DUPLICATION
* result and doesn't update the baseline.
*
* \param ptrWdContext
* The pointer to the widget context structure where all the widget parameters
* are stored.
*
* \param ptrSnsContext
* The pointer to the sensor context structure where the sensor data
* is stored.
*
* \param ptrSnsBslnInv
* The pointer to the sensor baseline inversion used for BIST if enabled.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns a status indicating whether the baseline has been updated:
* - CY_CAPSENSE_STATUS_SUCCESS - if baseline updating was successful.
* - CY_CAPSENSE_STATUS_BAD_DATA - if the BIST baseline integrity test is enabled and
*                                 the sensor's baseline and its inversion doesn't
*                                 match. In this case the function as well clears
*                                 the bit[2] (Widget Working) of the .status field
*                                 in the widget context structure preventing corrupted
*                                 data usage and set the CY_CAPSENSE_BIST_BSLN_INTEGRITY_MASK
*                                 bit of the .testResultMask field
*                                 in the /ref cy_stc_capsense_bist_context_t structure.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_FtUpdateBaseline(
                cy_stc_capsense_widget_context_t * ptrWdContext,
                cy_stc_capsense_sensor_context_t * ptrSnsContext,
                uint16_t * ptrSnsBslnInv,
                const cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t result;
    uint32_t bslnHistory;

