zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_filter.c
    result = Cy_CapSense_CheckBaselineInv(ptrWdContext, ptrSnsContext, ptrSnsBslnInv, context);

    if (CY_CAPSENSE_STATUS_SUCCESS == result)
    {
        /* Reset negative baseline counter */
        if (ptrSnsContext->raw >= ptrSnsContext->bsln)
        {
            ptrSnsContext->negBslnRstCnt = 0u;
        }

        /* Reset baseline */
        if ((uint32_t)ptrSnsContext->bsln > ((uint32_t)ptrWdContext->nNoiseTh + ptrSnsContext->raw))
        {
            if (ptrSnsContext->negBslnRstCnt >= ptrWdContext->lowBslnRst)
            {
                Cy_CapSense_FtInitializeBaseline(ptrSnsContext);
            }
            else
            {
                ptrSnsContext->negBslnRstCnt++;
            }
        }
        else
        {
            /*
            * Update baseline only if:
            * - signal is in range between noiseThreshold and negativenoiseThreshold
            * or
            * - sensor auto-reset is enabled
            */
            if ((0u != context->ptrCommonConfig->swSensorAutoResetEn) ||
                ((uint32_t)ptrSnsContext->raw <= ((uint32_t)ptrWdContext->noiseTh + ptrSnsContext->bsln)))
            {
                /* Get real baseline */
                bslnHistory = ((uint32_t)ptrSnsContext->bsln << CY_CAPSENSE_IIR_BL_SHIFT) | ptrSnsContext->bslnExt;
                /* Calculate baseline value */
                bslnHistory = Cy_CapSense_FtIIR1stOrder((uint32_t)ptrSnsContext->raw << CY_CAPSENSE_IIR_BL_SHIFT, bslnHistory, (uint32_t)ptrWdContext->bslnCoeff);
                /* Split baseline */
                ptrSnsContext->bsln = (uint16_t)(bslnHistory >> CY_CAPSENSE_IIR_BL_SHIFT);
                ptrSnsContext->bslnExt = (uint8_t)(bslnHistory);
            }
        }
        /* If BIST enabled, update the baseline inverse duplication */
        #if ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&\
             (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_BSLN_INTEGRITY_EN))
            *ptrSnsBslnInv = ~ptrSnsContext->bsln;
        #endif /* ((CY_CAPSENSE_ENABLE == CY_CAPSENSE_BIST_EN) &&\
                   (CY_CAPSENSE_ENABLE == CY_CAPSENSE_TST_BSLN_INTEGRITY_EN)) */
    }
    return result;
}


/*******************************************************************************
* Function Name: Cy_CapSense_InitializeAllBaselines
****************************************************************************//**
*
* Initializes the baselines of all the sensors of all active widgets.
*
* This function initializes baselines for all sensors and widgets
* in the project skipping low power widgets since their baselines are
* managed on HW level.
* It can also be used to re-initialize baselines at any time, however, note
* that all sensor data history information and sensor status shall be reset
* along with re-initialization of baseline.
*
* Following functions to initialize sensor and widgets and filter history
* should be called after initializing baseline for proper operation of
* the CAPSENSE&trade; middleware:
* * Cy_CapSense_InitializeAllStatuses()
* * Cy_CapSense_InitializeAllFilters()
*
* These functions are called by the CapSense_Enable() function, hence it is
* not required to use this function if above function is used.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM     - The input parameter is invalid.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_InitializeAllBaselines(cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_SUCCESS;
    uint32_t wdIndex;

    for (wdIndex = CY_CAPSENSE_TOTAL_WIDGET_COUNT; wdIndex-- > 0u;)
    {
        capStatus = Cy_CapSense_InitializeWidgetBaseline(wdIndex, context);
    }

    return capStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_InitializeWidgetBaseline
****************************************************************************//**
*
* Initializes the baselines of all the sensors in a specific widget.
*
* This function initializes baselines for all sensors in a specific widget
* in the project. It can also be used to re-initialize baselines at any time,
* however, note that all sensor data history information and sensor status
* should be reset along with re-initialization of baseline.
*
* The following functions to initialize sensor and widgets and filter history
* should be called after initializing baselines for proper operation of
* middleware.
* * Cy_CapSense_InitializeWidgetStatus()
* * Cy_CapSense_InitializeWidgetFilter()
*
* These functions are called by CapSense_Enable() function, hence it is not
* required to use this function is above function is used.
*
* \param widgetId
* Specifies the ID number of the widget. A macro for the widget ID can be found
* in the cycfg_capsense.h file defined as CY_CAPSENSE_<WIDGET_NAME>_WDGT_ID.
*
* \note For the fifth-generation low power CAPSENSE&trade; widgets
* of the \ref CY_CAPSENSE_WD_LOW_POWER_E type are not processed.
*
* \param context
* The pointer to the CAPSENSE&trade; context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the operation:
* - CY_CAPSENSE_STATUS_SUCCESS       - The operation is performed successfully.
* - CY_CAPSENSE_STATUS_BAD_PARAM     - The input parameter is invalid.
*
*******************************************************************************/
cy_capsense_status_t Cy_CapSense_InitializeWidgetBaseline(
                uint32_t widgetId,
                cy_stc_capsense_context_t * context)
{
    cy_capsense_status_t capStatus = CY_CAPSENSE_STATUS_SUCCESS;
    uint32_t snsIndex;

#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
    if (((uint8_t)CY_CAPSENSE_WD_LOW_POWER_E != context->ptrWdConfig[widgetId].wdType) &&
        ((uint8_t)CY_CAPSENSE_WD_LIQUID_LEVEL_E != context->ptrWdConfig[widgetId].wdType) &&
        ((uint8_t)CY_CAPSENSE_WD_LIQUID_PRESENCE_E != context->ptrWdConfig[widgetId].wdType))
#endif /* CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP */
    {
        for (snsIndex = context->ptrWdConfig[widgetId].numSns; snsIndex-- > 0u;)
        {
            capStatus = Cy_CapSense_InitializeSensorBaseline(widgetId, snsIndex, context);
        }
    }

